---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLines
source: html/1ee5595a-dde4-12a0-9979-ad2fdaca0738.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLines Property

Curtain grid lines cannot be copied. If you are trying to copy the curtain wall, try using tab to select entire wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyGridLines { get; }
```